In [1]:
import pandas as pd
from pandas import Series,DataFrame

In [2]:
serise = Series(data=[1,2,3],index=["a","b","c"])

In [3]:
serise

a    1
b    2
c    3
dtype: int64

In [7]:
dic = {"name":"tian","age":20,"food":"rice"}

In [8]:
serise_dic = Series(data=dic)

In [9]:
serise_dic

name    tian
age       20
food    rice
dtype: object

In [10]:
dic = {
    'java':[60,70,80],
    'python':[100,100,100]
}
DataFrame(data=dic,index=['zhangsan','lisi','wangwu'])

          java  python
zhangsan    60     100
lisi        70     100
wangwu      80     100

In [11]:
import numpy as np

In [20]:
df = DataFrame(data=np.random.rand(5,4),index=[0,1,2,3,4],columns=["one","two","three","four"])

In [21]:
df

        one       two     three      four
0  0.747211  0.291520  0.418211  0.056703
1  0.147195  0.259611  0.683647  0.547080
2  0.144602  0.296325  0.874265  0.121922
3  0.681689  0.477800  0.537221  0.714386
4  0.361367  0.465931  0.311641  0.895972

In [22]:
df2 = DataFrame(data={"name":list("abccbacba"),"num":[2,3,1,4,3,5,7,3,1]})

In [23]:
df2

  name  num
0    a    2
1    b    3
2    c    1
3    c    4
4    b    3
5    a    5
6    c    7
7    b    3
8    a    1

In [60]:
new = df2.groupby(df2['name']).mean()

In [61]:
new

           num
name
a     2.666667
b     3.000000
c     4.000000

In [57]:
dict(list(new))

{'a': 0    2
 5    5
 8    1
 Name: num, dtype: int64,
 'b': 1    3
 4    3
 7    3
 Name: num, dtype: int64,
 'c': 2    1
 3    4
 6    7
 Name: num, dtype: int64}

In [36]:
for k,v in new:
    print(k,v)

a   name  num
0    a    2
5    a    5
8    a    1
b   name  num
1    b    3
4    b    3
7    b    3
c   name  num
2    c    1
3    c    4
6    c    7

In [32]:
new_data = pd.DataFrame(columns=["key", "value"])
new_data

Empty DataFrame
Columns: [key, value]
Index: []

In [37]:
for k,v in new:
    pd.concat([new_data,v])

In [38]:
new_data

Empty DataFrame
Columns: [key, value]
Index: []

In [4]:
import pandas as pd
import numpy as np
df = pd.DataFrame(data=np.random.rand(5,4),index=[0,1,2,3,4],columns=["one","two","three","four"])

In [9]:
df['one']

0    0.635940
1    0.316341
2    0.740232
3    0.086649
4    0.390086
Name: one, dtype: float64

In [16]:
np.array(df[['one','three']])

array([[0.63593988, 0.65125012],
       [0.3163408 , 0.08147222],
       [0.74023169, 0.17348494],
       [0.08664873, 0.94434412],
       [0.39008577, 0.78445389]])

In [15]:
df

        one       two     three      four
0  0.635940  0.333677  0.651250  0.404919
1  0.316341  0.357268  0.081472  0.548545
2  0.740232  0.690551  0.173485  0.869321
3  0.086649  0.723118  0.944344  0.236287
4  0.390086  0.761614  0.784454  0.780232